Revit 2027 API
PanelScheduleTemplate.IsDefault Property
 Checks to see if this is default template for the given panel schedule type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDefault { get; }
Public ReadOnly Property IsDefault As Boolean
	Get
public:
property bool IsDefault {
	bool get ();
}
member IsDefault : bool with get
Property Value
Boolean
See Also
Reference
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace